Revit 2027 API
TessellatedShapeBuilder.GetBuildResult Method
 Get the built geometry, build status and other data stored in TessellatedShapeBuilderResult. Clears the stored data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TessellatedShapeBuilderResult GetBuildResult()
Public Function GetBuildResult As TessellatedShapeBuilderResult
public:
TessellatedShapeBuilderResult^ GetBuildResult()
member GetBuildResult : unit -> TessellatedShapeBuilderResult
Return Value
TessellatedShapeBuilderResult
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace